snlkuharlocal/src/Documents/Перемаркировка/Перемаркировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Перемаркировка</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплектующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаКомплектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПеремаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродукции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыУдаленные</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокОснование</name>
      <type>
        <types>DocumentRef.ЛистПереукладки</types>
        <types>DocumentRef.ЛистНабора</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыКомплектов</name>
    <attributes>
      <name>ВидКомплекта</name>
      <type>
        <types>EnumRef.ВидыКомплектов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/СтатусыПеремаркировки/СтатусыПеремаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПеремаркировки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтработкеЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОбработаноЧЗ</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ПолученоСкладом</name>
  </enumValues>
  <enumValues>
    <name>Сканирование</name>
  </enumValues>
  <enumValues>
    <name>Обработано</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыДокументовМаркировки/СтатусыДокументовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовМаркировки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтложеннойОбработки</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обрабатывается</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОбработанЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЧЗ</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыКомплектов/ВидыКомплектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКомплектов</name>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Ассортито</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>ГотовыйКомплект</name>
  </enumValues>
  <enumValues>
    <name>АссортитоКомплектов</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипУзлаИБ/ТипУзлаИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипУзлаИБ</name>
  <enumValues>
    <name>ИнтегральнаяИБ</name>
  </enumValues>
  <enumValues>
    <name>УправляющееПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ТорговоеПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаданиеНаСборкуКомплектовЧЗ/ЗаданиеНаСборкуКомплектовЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНаСборкуКомплектовЧЗ</name>
  <comment>Задание на сборку комплектов ЗЧ</comment>
  <basedOn>Document.ЗаданиеНабора</basedOn>
  <basedOn>Document.Комплектация</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>InformationRegister.РезервыКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <registerRecords>InformationRegister.ОшибкиПолученияКМ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемаркировка</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>СформированыАгрегации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНабора</name>
    <type>
      <types>DocumentRef.ЗаданиеНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоШК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплектующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбработкиЧЗ</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьМаркированыеКомплектующие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛистСборки</name>
      <type>
        <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Распечатан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Нанесен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗабронированПодСборку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/Перемаркировка/ObjectModule.bsl
#Область ОписаниеПеременных
Перем СостояниеДоПерезаписи;
Перем ЕстьИзменения;
Перем РежимЗаписиДокНового; 
#КонецОбласти 

#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ОбщегоНазначенияС.ЗаполнитьШапкуДокументаСервер(ЭтотОбъект,ОбщегоНазначенияС.ТекущийПользователь()); 
	Статус = ПредопределенноеЗначение("Перечисление.СтатусыПеремаркировки.ВРаботе"); //
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		//++Данилова Е.В. 26.06.2026 Изм.№0000000222
		ЗарегистрироватьИзмененияПолученоСкладом();
		//--Данилова Е.В. 26.06.2026 
		Возврат; 
	КонецЕсли;
	ТипУзла	= Маркировка_ПИ.ТипТекущегоУзла();
	Если Не Отказ 
		И (Проведен 
		ИЛИ РежимЗаписиДокНового = РежимЗаписиДокумента.Проведение) Тогда
		 
		Если Статус = Перечисления.СтатусыПеремаркировки.КОтработкеЧЗ 
			Или Статус = Перечисления.СтатусыПеремаркировки.ОбработаноЧЗ
			//++Данилова Е.В. 26.06.2026 Изм.№0000000222 
			ИЛИ Статус = Перечисления.СтатусыПеремаркировки.ПолученоСкладом Тогда
			//--Данилова Е.В. 26.06.2026 
			//	
			//++Данилова Е.В. 26.06.2026 Изм.№0000000222
			//перенесено создание в офис по регламенту 
//			Если Статус = Перечисления.СтатусыПеремаркировки.КОтработкеЧЗ 
//				И СостояниеДоПерезаписи <> Статус
//				И ТипУзла = Перечисления.ТипУзлаИБ.Склад Тогда
//				ИдентификаторФЗ = Новый УникальныйИдентификатор;
//				МаркировкаС.ЗапуститьВФонеСозданиеЗаказовКодовМаркировки(ссылка, ИдентификаторФЗ);
//			КонецЕсли;
			//--Данилова Е.В. 26.06.2026 
			//++Данилова Е.В. 11.06.2026 исправление MARK-3615 
			//СтатусдляВыгрузки = Статус = Перечисления.СтатусыПеремаркировки.ОбработаноЧЗ ; 
			//НужноВыгружать	= Документы.Перемаркировка.НужноВыгружатьДокПеремаркировка(СтатусдляВыгрузки, Ссылка,
			//РежимЗаписиДокумента, ПометкаУдаления);
			//++Данилова Е.В. 26.06.2026 Изм.№0000000222
			ИзмененСтатус = СостояниеДоПерезаписи <> Статус;
			
			НужноВыгружать	= Документы.Перемаркировка.НужноВыгружатьДокПеремаркировка(ИзмененСтатус, Ссылка,
			РежимЗаписиДокумента, ПометкаУдаления); 
			
//			НужноВыгружать	= Документы.Перемаркировка.НужноВыгружатьДокПеремаркировка(истина, Ссылка,
//			РежимЗаписиДокумента, ПометкаУдаления); 
			//--Данилова Е.В. 11.06.2026 
			//--Данилова Е.В. 26.06.2026 
			ДополнительныеСвойства.Вставить("НужноВыгружать", НужноВыгружать);
			
			Если НужноВыгружать Тогда
				Документы.Перемаркировка.УстановитьПолучателейИзменений(ЭтотОбъект);
			КонецЕсли;
		КонецЕсли;
		
		Если Статус = Перечисления.СтатусыПеремаркировки.Обработано
			И СостояниеДоПерезаписи <> Статус Тогда
			ЗаданиеНаСборку = ОбщегоНазначенияС.НайтиДокументНаСервере("ЗаданиеНаСборкуКомплектовЧЗ",
			Новый Структура("ДокОснование,Проведен", Ссылка, Истина));///
			Если ЗначениеЗаполнено(ЗаданиеНаСборку) Тогда
				
				Если ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(ЗаданиеНаСборку, "КоличествоШК", "Документ") > 0 Тогда
					ДопПараметры = Новый Структура("Статус", Перечисления.СтатусыДокументовМаркировки.КОбработке);
				Иначе
					ДопПараметры = Неопределено;
				КонецЕсли;
				
				Документы.ЗаданиеНаСборкуКомплектовЧЗ.Создать_Агрегации(ЗаданиеНаСборку, ДопПараметры);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		//++Данилова Е.В. 26.06.2026 Изм.№0000000222
		УстановитьСтатусПолученоСкладом(); 
		//--Данилова Е.В. 26.06.2026 
		Возврат; 
	КонецЕсли;
	Если НЕ ЭтоНовый() Тогда
		СостояниеДоПерезаписи = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(ссылка, "Статус");  
	Иначе
		 СостояниеДоПерезаписи = Перечисления.СтатусыПеремаркировки.ПустаяСсылка(); 
	 КонецЕсли;
	 
	 РежимЗаписиДокНового = РежимЗаписи; 
	
	ЕстьИзменения = Модифицированность(); 
	Если ЕстьИзменения И Не ПроверитьВведеннуюНоменклатуру() Тогда
		Отказ = Истина;
		Сообщить(
			"В документе могут быть указаны только спайки или только штуки (готовые комплекты). Разделите документ!");
	КонецЕсли
	; 
	Если ОтгрузкаКомплектов И Комплектующие.Количество() = 0 Тогда
		Отказ = Истина;
		Сообщить("Заполните комплектующие!");
		Возврат; 
	КонецЕсли;
	Если ОтгрузкаКомплектов Тогда
	
		КоличествоТоваров = Товары.Итог("Количество"); 	
	    КоличествоПродукции = Комплектующие.Итог("КоличествоПродукции");
		Если КоличествоТоваров <> КоличествоПродукции Тогда
			
			Отказ = Истина;
			Сообщить("Перезаполните комплектующие, несоответствие по количеству продукции!");	
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ОбщегоНазначенияС.ЗаполнитьШапкуДокументаСервер(ЭтотОбъект,ОбщегоНазначенияС.ТекущийПользователь()); //
	Статус = ПредопределенноеЗначение("Перечисление.СтатусыПеремаркировки.ВРаботе");
	ТоварыУдаленные.Очистить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыиФункции

Функция ПроверитьВведеннуюНоменклатуру() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТЧТовары.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&Товары КАК ТЧТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|		КОГДА НоменклатураСпр.родитель.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
		|			ТОГДА НоменклатураСпр.родитель.ВидКомплекта
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Товар)
		|	КОНЕЦ) КАК ВидКомплекта
		|ИЗ
		|	ВТТовары КАК ТЧТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
		|		ПО ТЧТовары.Номенклатура = НоменклатураСпр.Ссылка
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
		|		КОГДА НоменклатураСпр.родитель.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект)
		|			ТОГДА НоменклатураСпр.родитель.ВидКомплекта
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Товар)
		|	КОНЕЦ) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НоменклатураСпр.родитель.ВидКомплекта КАК ВидКомплекта
		|ИЗ
		|	ВТТовары КАК ТЧТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
		|		ПО ТЧТовары.Номенклатура = НоменклатураСпр.Ссылка";
	
	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить());
		
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	РезультатПроверка = ПакетЗапросов[1];
	ВыборкаВид =  ПакетЗапросов[2].Выбрать();
	ВидыКомплектов.Очистить();	
	Пока ВыборкаВид.Следующий() Цикл
		НСтрока = ВидыКомплектов.Добавить(); 
		НСтрока.ВидКомплекта = ВыборкаВид.ВидКомплекта; 
	КонецЦикла;
	
	Возврат РезультатПроверка.Пустой(); 
	
КонецФункции

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если ЗначениеЗаполнено(Организация) Тогда
		Префикс = СокрЛП(Организация.Префикс)+"-";	
	КонецЕсли;
КонецПроцедуры

//++Данилова Е.В. 26.06.2026 Изм.№0000000222
Процедура УстановитьСтатусПолученоСкладом()
	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.Склад И Статус
		= Перечисления.СтатусыПеремаркировки.КОтправкеНаСклад Тогда
			
		Статус = Перечисления.СтатусыПеремаркировки.ПолученоСкладом; 
			
	КонецЕсли;
КонецПроцедуры

Процедура ЗарегистрироватьИзмененияПолученоСкладом()

	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.Склад
		И Статус = Перечисления.СтатусыПеремаркировки.ПолученоСкладом Тогда
		//++Данилова Е.В. 01.07.2026 №Изм.0000000222
		ОбменДанными.Отправитель = неопределено;
		//--Данилова Е.В. 01.07.2026 
		Документы.Перемаркировка.УстановитьПолучателейИзменений(ЭтотОбъект);
		
	КонецЕсли;

КонецПроцедуры

//--Данилова Е.В. 26.06.2026 
#КонецОбласти
